{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|system|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|user|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<|assistant|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "Final Answer:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "<|system|>": 5,
      "<|user|>": 6,
      "<|assistant|>": 7,
      "Final Answer:": 8,
      "\"": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      ":": 25,
      "=": 26,
      "A": 27,
      "C": 28,
      "F": 29,
      "L": 30,
      "S": 31,
      "T": 32,
      "W": 33,
      "\\": 34,
      "a": 35,
      "b": 36,
      "c": 37,
      "d": 38,
      "e": 39,
      "f": 40,
      "g": 41,
      "h": 42,
      "i": 43,
      "l": 44,
      "m": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "q": 49,
      "r": 50,
      "s": 51,
      "t": 52,
      "u": 53,
      "v": 54,
      "w": 55,
      "x": 56,
      "y": 57,
      "{": 58,
      "}": 59,
      "in": 60,
      "te": 61,
      "ti": 62,
      "th": 63,
      "er": 64,
      "le": 65,
      "\":": 66,
      "ati": 67,
      "on": 68,
      "the": 69,
      "om": 70,
      "pr": 71,
      "ru": 72,
      "rule": 73,
      "**": 74,
      "al": 75,
      "\",": 76,
      ".\\": 77,
      "pe": 78,
      "to": 79,
      "der": 80,
      "iv": 81,
      "ve": 82,
      "ative": 83,
      "omp": 84,
      "pro": 85,
      "deriv": 86,
      "derivative": 87,
      "sin": 88,
      "gr": 89,
      "inte": 90,
      "integr": 91,
      "ch": 92,
      "es": 93,
      "ct": 94,
      "et": 95,
      "nt": 96,
      "of": 97,
      "ute": 98,
      "ompute": 99,
      ").\\": 100,
      "ex": 101,
      "exp": 102,
      ")\\": 103,
      "co": 104,
      "cos": 105,
      "fin": 106,
      "integral": 107,
      "\"}": 108,
      ".\",": 109,
      "An": 110,
      "Compute": 111,
      "Fin": 112,
      "Let": 113,
      "We": 114,
      "ble": 115,
      "ith": 116,
      "lu": 117,
      "ly": 118,
      "nti": 119,
      "nFin": 120,
      "nWe": 121,
      "olu": 122,
      "pp": 123,
      "qu": 124,
      "res": 125,
      "sw": 126,
      "solu": 127,
      "ty": 128,
      "with": 129,
      "{\"": 130,
      "tion": 131,
      "ation": 132,
      "pect": 133,
      "proble": 134,
      "Answ": 135,
      "nFinal": 136,
      "pply": 137,
      "respect": 138,
      "solution": 139,
      "type": 140,
      "problem": 141,
      "Answer": 142,
      "Ste": 143,
      "ent": 144,
      "nSte": 145,
      "rules": 146,
      "nStep": 147,
      ")*": 148,
      "/(": 149,
      ")/(": 150,
      "'(": 151,
      "Apply": 152,
      "at": 153,
      "ant": 154,
      "anti": 155,
      "de": 156,
      "ds": 157,
      "el": 158,
      "ite": 159,
      "iqu": 160,
      "iel": 161,
      "nApply": 162,
      "niqu": 163,
      "su": 164,
      "want": 165,
      "yiel": 166,
      "ing": 167,
      "inde": 168,
      "tech": 169,
      "that": 170,
      "integration": 171,
      "find": 172,
      "finite": 173,
      "antiderivative": 174,
      "nApplying": 175,
      "niques": 176,
      "such": 177,
      "yields": 178,
      "indefinite": 179,
      "techniques": 180,
      "Com": 181,
      "Th": 182,
      "ap": 183,
      "ar": 184,
      "ain": 185,
      "ate": 186,
      "apply": 187,
      "bin": 188,
      "comp": 189,
      "compute": 190,
      "di": 191,
      "du": 192,
      "enti": 193,
      "ff": 194,
      "get": 195,
      "iate": 196,
      "oti": 197,
      "usin": 198,
      "erenti": 199,
      "onent": 200,
      "priate": 201,
      "produ": 202,
      "propriate": 203,
      "chain": 204,
      "quoti": 205,
      "Combin": 206,
      "The": 207,
      "appropriate": 208,
      "are": 209,
      "component": 210,
      "computed": 211,
      "diff": 212,
      "using": 213,
      "erentiation": 214,
      "product": 215,
      "quotient": 216,
      "Combine": 217,
      "components": 218,
      "differentiation": 219,
      ")**": 220,
      ")\",": 221,
      "lo": 222,
      "log": 223
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        "t",
        "e"
      ],
      [
        "t",
        "i"
      ],
      [
        "t",
        "h"
      ],
      [
        "e",
        "r"
      ],
      [
        "l",
        "e"
      ],
      [
        "\"",
        ":"
      ],
      [
        "a",
        "ti"
      ],
      [
        "o",
        "n"
      ],
      [
        "th",
        "e"
      ],
      [
        "o",
        "m"
      ],
      [
        "p",
        "r"
      ],
      [
        "r",
        "u"
      ],
      [
        "ru",
        "le"
      ],
      [
        "*",
        "*"
      ],
      [
        "a",
        "l"
      ],
      [
        "\"",
        ","
      ],
      [
        ".",
        "\\"
      ],
      [
        "p",
        "e"
      ],
      [
        "t",
        "o"
      ],
      [
        "d",
        "er"
      ],
      [
        "i",
        "v"
      ],
      [
        "v",
        "e"
      ],
      [
        "ati",
        "ve"
      ],
      [
        "om",
        "p"
      ],
      [
        "pr",
        "o"
      ],
      [
        "der",
        "iv"
      ],
      [
        "deriv",
        "ative"
      ],
      [
        "s",
        "in"
      ],
      [
        "g",
        "r"
      ],
      [
        "in",
        "te"
      ],
      [
        "inte",
        "gr"
      ],
      [
        "c",
        "h"
      ],
      [
        "e",
        "s"
      ],
      [
        "c",
        "t"
      ],
      [
        "e",
        "t"
      ],
      [
        "n",
        "t"
      ],
      [
        "o",
        "f"
      ],
      [
        "u",
        "te"
      ],
      [
        "omp",
        "ute"
      ],
      [
        ")",
        ".\\"
      ],
      [
        "e",
        "x"
      ],
      [
        "ex",
        "p"
      ],
      [
        ")",
        "\\"
      ],
      [
        "c",
        "o"
      ],
      [
        "co",
        "s"
      ],
      [
        "f",
        "in"
      ],
      [
        "integr",
        "al"
      ],
      [
        "\"",
        "}"
      ],
      [
        ".",
        "\","
      ],
      [
        "A",
        "n"
      ],
      [
        "C",
        "ompute"
      ],
      [
        "F",
        "in"
      ],
      [
        "L",
        "et"
      ],
      [
        "W",
        "e"
      ],
      [
        "b",
        "le"
      ],
      [
        "i",
        "th"
      ],
      [
        "l",
        "u"
      ],
      [
        "l",
        "y"
      ],
      [
        "n",
        "ti"
      ],
      [
        "n",
        "Fin"
      ],
      [
        "n",
        "We"
      ],
      [
        "o",
        "lu"
      ],
      [
        "p",
        "p"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "es"
      ],
      [
        "s",
        "w"
      ],
      [
        "s",
        "olu"
      ],
      [
        "t",
        "y"
      ],
      [
        "w",
        "ith"
      ],
      [
        "{",
        "\""
      ],
      [
        "ti",
        "on"
      ],
      [
        "ati",
        "on"
      ],
      [
        "pe",
        "ct"
      ],
      [
        "pro",
        "ble"
      ],
      [
        "An",
        "sw"
      ],
      [
        "nFin",
        "al"
      ],
      [
        "pp",
        "ly"
      ],
      [
        "res",
        "pect"
      ],
      [
        "solu",
        "tion"
      ],
      [
        "ty",
        "pe"
      ],
      [
        "proble",
        "m"
      ],
      [
        "Answ",
        "er"
      ],
      [
        "S",
        "te"
      ],
      [
        "e",
        "nt"
      ],
      [
        "n",
        "Ste"
      ],
      [
        "rule",
        "s"
      ],
      [
        "nSte",
        "p"
      ],
      [
        ")",
        "*"
      ],
      [
        "/",
        "("
      ],
      [
        ")",
        "/("
      ],
      [
        "'",
        "("
      ],
      [
        "A",
        "pply"
      ],
      [
        "a",
        "t"
      ],
      [
        "a",
        "nt"
      ],
      [
        "a",
        "nti"
      ],
      [
        "d",
        "e"
      ],
      [
        "d",
        "s"
      ],
      [
        "e",
        "l"
      ],
      [
        "i",
        "te"
      ],
      [
        "i",
        "qu"
      ],
      [
        "i",
        "el"
      ],
      [
        "n",
        "Apply"
      ],
      [
        "n",
        "iqu"
      ],
      [
        "s",
        "u"
      ],
      [
        "w",
        "ant"
      ],
      [
        "y",
        "iel"
      ],
      [
        "in",
        "g"
      ],
      [
        "in",
        "de"
      ],
      [
        "te",
        "ch"
      ],
      [
        "th",
        "at"
      ],
      [
        "integr",
        "ation"
      ],
      [
        "fin",
        "d"
      ],
      [
        "fin",
        "ite"
      ],
      [
        "anti",
        "derivative"
      ],
      [
        "nApply",
        "ing"
      ],
      [
        "niqu",
        "es"
      ],
      [
        "su",
        "ch"
      ],
      [
        "yiel",
        "ds"
      ],
      [
        "inde",
        "finite"
      ],
      [
        "tech",
        "niques"
      ],
      [
        "C",
        "om"
      ],
      [
        "T",
        "h"
      ],
      [
        "a",
        "p"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "in"
      ],
      [
        "a",
        "te"
      ],
      [
        "a",
        "pply"
      ],
      [
        "b",
        "in"
      ],
      [
        "c",
        "omp"
      ],
      [
        "c",
        "ompute"
      ],
      [
        "d",
        "i"
      ],
      [
        "d",
        "u"
      ],
      [
        "e",
        "nti"
      ],
      [
        "f",
        "f"
      ],
      [
        "g",
        "et"
      ],
      [
        "i",
        "ate"
      ],
      [
        "o",
        "ti"
      ],
      [
        "u",
        "sin"
      ],
      [
        "er",
        "enti"
      ],
      [
        "on",
        "ent"
      ],
      [
        "pr",
        "iate"
      ],
      [
        "pro",
        "du"
      ],
      [
        "pro",
        "priate"
      ],
      [
        "ch",
        "ain"
      ],
      [
        "qu",
        "oti"
      ],
      [
        "Com",
        "bin"
      ],
      [
        "Th",
        "e"
      ],
      [
        "ap",
        "propriate"
      ],
      [
        "ar",
        "e"
      ],
      [
        "comp",
        "onent"
      ],
      [
        "compute",
        "d"
      ],
      [
        "di",
        "ff"
      ],
      [
        "usin",
        "g"
      ],
      [
        "erenti",
        "ation"
      ],
      [
        "produ",
        "ct"
      ],
      [
        "quoti",
        "ent"
      ],
      [
        "Combin",
        "e"
      ],
      [
        "component",
        "s"
      ],
      [
        "diff",
        "erentiation"
      ],
      [
        ")",
        "**"
      ],
      [
        ")",
        "\","
      ],
      [
        "l",
        "o"
      ],
      [
        "lo",
        "g"
      ]
    ]
  }
}